export const Navkar = `नमो अरिहंताणं। 
नमो सिद्धाणं।
नमो आयरियाणं। 
नमो उवज्झायाणं।
नमो लोए सव्वसाहूणं। 
एसो पंच नमोक्कारो।
एसोपंचणमोक्कारो। सव्वपावप्पणासणो।
मंगलाणम च सव्वेसिं। पढमं हवई मंगलं।`;

export const Namorhat = `नमोर्हंतसिद्धाचार्योपाध्यायःसर्वसाधुभ्यः .1.`;

export const Khamasaman = `इच्छामि खमा-समणो! वंदिउं, 
जावणिज्जाए निसीहिआए,
मत्थएण वंदामि.. .1.`;

export const Icchakar = `इच्छकार सुह-राइ ? (सुह-देवसि?) सुख-तप ?
शरीर-निराबाध ? सुख-संजम-यात्रा-निर्वहते हो जी ?
स्वामि ! शाता है जी ? आहार-पानी का लाभ देना जी.    .1.`;

export const Abbhutthio = `इच्छा-कारेण संदिसह भगवन् !
अब्भुट्ठिओमि, अब्भिंतर-देवसिअं खामेउं ?
इच्छं, खामेमि देवसिअं.
जं किंचि अपत्तिअं, पर-पत्तिअं; भत्ते, पाणे;
विणए, वेयावच्चे; आलावे, संलावे; उच्चासणे, समासणे;
अंतर-भासाए, उवरि-भासाए;
जं किंचि मज्झ विणय-परिहीणं, सुहुमं वा, बायरं वा;
तुब्भे जाणह, अहं न जाणामि; तस्स मिच्छा मि दुक्कडं........1.`;

export const Iryavahiyam = `इच्छा-कारेण संदिसह भगवन् ! इरियावहियं पडिक्कमामि ?
इच्छं, इच्छामि पडिक्कमिउं .1.
इरियावहियाए, विराहणाए .2.
गमणागमणे .3.
पाण-क्कमणे, बीय-क्कमणे, हरिय-क्कमणे,
ओसा-उत्तिंग-पणग-दग-मट्टी-मक्कडा-संताणा-संकमणे .4.
जे मे जीवा विराहिया .5.
एगिंदिया, बेइंदिया, तेइंदिया, चउरिंदिया, पंचिंदिया .6.
अभिहया, वत्तिया, लेसिया, संघाइया, संघट्टिया,
परियाविया, किलामिया, उद्दविया,
ठाणाओ ठाणं संकामिया, जीवियाओ ववरोविया,
तस्स मिच्छा मि दुक्कडं .7.`;

export const Tassuttari = `तस्स उत्तरी-करणेणं,
पायच्छित्त-करणेणं,
विसोही-करणेणं, 
विसल्ली-करणेणं,
पावाणं कम्माणं निग्घायणट्ठाए,
ठामि काउस्सग्गं`;

export const Annath = `अन्नत्थ-ऊससिएणं, नीससिएणं, खासिएणं, छीएणं, जंभाइएणं,
उड्डुएणं, वाय-निसग्गेणं, भमलीए, पित्त-मुच्छाए .1.
सुहुमेहिं अंग-संचालेहिं, सुहुमेहिं खेल-संचालेहिं,
सुहुमेहिं दिट्ठि-संचालेहिं .2.
एवमाइएहिं आगारेहिं, अभग्गो अविराहिओ,
हुज्ज मे काउस्सग्गो | .3.
जाव अरिहंताणं भगवंताणं, नमुक्कारेणं न पारेमि .4.
ताव कायं ठाणेणं मोणेणं झाणेणं, अप्पाणं वोसिरामि .5.`;

export const Logass = `लोगस्स उज्जोअ-गरे, धम्म-तित्थ-यरे जिणे
अरिहंते कित्तइस्सं, चउवीसं पि केवली 1
उसभ-मजिअं च वंदे, संभव-मभिणंदणं च सुमइं च
पउम-प्पहं सुपासं, जिणं च चंद-प्पहं वंदे 2
सुविहिं च पुप्फ-दंतं, सीअल-सिज्जंस-वासु-पुज्जं च
विमल-मणंतं च जिणं, धम्मं संतिं च वंदामि 3
कुंथुं अरं च मल्लिं, वंदे मुणि-सुव्वयं नमि-जिणं च
वंदामि रिट्ठ-नेमिं, पासं तह वद्धमाणं च 4
एवं मए अभिथुआ, विहुय-रय-मला पहीण-जर-मरणा
चउ-वीसं पि जिणवरा, तित्थ-यरा मे पसीयंतु 5
कित्तिय-वंदिय-महिया, जे ए लोगस्स उत्तमा सिद्धा
आरुग्ग-बोहि-लाभं, समाहि-वर-मुत्तमं-दिंतु 6
चंदेसु निम्मल-यरा, आइच्चेसु अहियं पयास-यरा
सागर-वर-गंभीरा, सिद्धा सिद्धिं मम दिसंतु 7`;

export const Jankinchi = `जं किंचि नाम तित्थं ,
सग्गे पायालि मणुस्से लोए ,
जाइं जिण बिंबाइं, 
ताइं सव्वाइं वंदामि .1.`;

export const Namutthunam = `नमुत्थु णं, अरिहंताणं, भगवंताणं .1.
आइ-गराणं, तित्थ-यराणं, सयं-संबुद्धाणं .2.
पुरिसुत्तमाणं, पुरिस-सीहाणं, पुरिस-वर-पुंडरीआणं,
पुरिस-वर-गंध-हत्थीणं .3.
लोगुत्तमाणं, लोग-नाहाणं, लोग-हिआणं,
लोग-पईवाणं, लोग-पज्जोअ-गराणं .4.
अभय-दयाणं, चक्खु-दयाणं, मग्ग-दयाणं,
सरण-दयाणं, बोहि-दयाणं .5.
धम्म-दयाणं, धम्म-देसयाणं, धम्म-नायगाणं,
धम्म-सारहीणं, धम्म-वर-चाउरंत-चक्कवट्टीणं .6.
अप्पडिहय-वर-नाण-दंसण-धराणं, वियट्ट-छउमाणं .7.
जिणाणं, जावयाणं, तिन्नाणं, तारयाणं, बुद्धाणं,
बोहयाणं, मुत्ताणं, मोअगाणं .8.
सव्वन्नूणं, सव्व-दरिसीणं, सिव-मयल-मरुअ-मणंत-
मक्खय-मव्वाबाह-मपुणरावित्ति सिद्धिगइ-नामधेयं
ठाणं संपत्ताणं, नमो जिणाणं, जिअ-भयाणं .9.
जे अ अईया सिद्धा, जे अ भविस्संति-णागए काले.
संपइ अ वट्टमाणा, सव्वे ति-विहेण वंदामि .10.`;

export const Javanticheiam = `जावंति चेइआइं, 
उड्डे अ अहे अ तिरिअ लोए अ,
सव्वाइं ताइं वंदे
इह संतो तत्थ संताइं.. .1.`;

export const Javantkevisahu = `जावंति चेइआइं, 
उड्डे अ अहे अ तिरिअ लोए अ,
सव्वाइं ताइं वंदे
इह संतो तत्थ संताइं.. .1.`;

export const Uvasaggaharm = `उवसग्ग-हरं पासं, पासं वंदामि कम्म-घण मुक्कं ।
विसहर-विस-निन्नासं, मंगल-कल्लाण-आवासं ।।१।।
विसहर-फुलिंग-मंतं, कंठे धारेइ जो सया मणुओ ।
तस्स गह-रोग-मारी, दुट्ठ जरा जंति उवसामं ।।२।।
चिट्ठउ दुरे मंतो, तुज्झ पणामो वि बहु फलो होइ ।
नर-तिरिएसु वि जीवा, पावंति न दुक्ख-दोगच्चं।।३।।
तुह सम्मत्ते लद्धे, चिंतामणि-कप्प-पायव-ब्भहिए ।
पावंति अविग्घेणं, जीवा अयरामरं ठाणं ।।४।।
इअ संथुओ महायस ! भत्ति-ब्भर-निब्भरेण हिअएण ।
ता देव ! दिज्ज बोहिं, भवे भवे पास ! जिण-चंद ! ।।5।।`;

export const Jayviyaraya = `जय वीयराय! जग-गुरु!, 
होउ ममं तुह प्पभावओ भयवं!
भव-निव्वेओ मग्गाणुसारिआ इट्ठफल-सिद्धी    1
लोग-विरुद्ध-च्चाओ गुरु-जण-पूआ परत्थ-करणं च
सुह-गुरु-जोगो तव्वयण-सेवणा आ-भवमखंडा    2
वारिज्जइ जइ वि नियाण-बंधणं वीयराय! तुह समये
तह वि मम हुज्ज सेवा, भवे भवे तुम्ह चलणाणं    3
दुक्ख-क्खओ कम्म-क्खओ, 
समाहि-मरणं च बोहि-लाभो अ
संपज्जउ मह एअं, तुह नाह! पणाम-करणेणं    4
सर्व-मंगल-मांगल्यं , सर्व कल्याण कारणम् ।
प्रधानां सर्व धर्माणां, जैन जयतु शासनम् ॥  5`;

export const Jayviyarayashort = `जय वीयराय! जग-गुरु!, 
होउ ममं तुह प्पभावओ भयवं!
भव-निव्वेओ मग्गाणुसारिआ इट्ठफल-सिद्धी    1
लोग-विरुद्ध-च्चाओ गुरु-जण-पूआ परत्थ-करणं च
सुह-गुरु-जोगो तव्वयण-सेवणा आ-भवमखंडा    2`;

export const Arihantecheiyanam = `अरिहंत-चेइयाणं, 
करेमि काउस्सग्गं .1.
वंदण-वत्तिआए, पूअण-वत्तिआए, 
सक्कार-वत्तिआए,सम्माण-वत्तिआए, 
बोहि-लाभ-वत्तिआए, 
निरुवसग्ग-वत्तिआए… 2.
सद्धाए, मेहाए, धिईए, धारणाए, 
अणुप्पेहाए वड्ढमाणीए, 
ठामि काउस्सग्गं...3.`;

export const Pukkharvardivaddhe = `पुक्खर-वर-दीवड्ढे, धायइ-संडे अ जंबु-दीवे अ.
भरहेरवय-विदेहे, धम्माइ-गरे नमंसामि .1.
तम-तिमिर-पडल-विद्धं-सणस्स सुर-गण-नरिंद-महिअस्स.
सीमा-धरस्स वंदे, 
पप्फोडिअ-मोह जालस्स .2.
जाई-जरा-मरण-सोग-पणासणस्स,
कल्लाण-पुक्खल-विसाल-सुहा-वहस्स.
को देव-दाणव-नरिंद-गण-च्चिअस्स,
धम्मस्स सार-मुवलब्भ करे पमायं? .3.
सिद्धे भो! पयओ नमो जिण-मए नंदी सया संजमे,
देवं-नाग-सुवन्न-किन्नर-गण-स्सब्भूअ-भावच्चिए.
लोगो जत्थ पइट्ठिओ जगमिणं तेलुक्क-मच्चासुरं,
धम्मो वड्ढउ सासओ विजयओ धम्मुत्तरं वड्ढउ .4.`;

export const Siddhanambuddhanam = `सिद्धाणं बुद्धाणं, पार-गयाणं परंपर-गयाणं
लोअग्ग-मुवगयाणं, 
नमो सया सव्व-सिद्धाणं 1 
जो देवाण वि देवो, 
जं देवा पंजली नमंसंति
तं देव-देव-महिअं, 
सिरसा वंदे महावीरं 2 
इक्को वि नमुक्कारो, 
जिणवर-वसहस्स वद्धमाणस्स
संसार-सागराओ, तारेइ नरं व नारिं वा 3 
उज्जिंत-सेल-सिहरे, 
दिक्खा नाणं निसीहिआ जस्स
तं धम्म-चक्कवट्टिं, अरिट्ठ-नेमिं नमंसामि 4 
चत्तारि अट्ठ दस दो य, वंदिया जिणवरा चउव्वीसं
परमट्ठ-निट्ठि-अट्ठा,
 सिद्धा सिद्धिं मम दिसंतु 5`;
