export const Navkar = `नमो अरिहंताणं। 
नमो सिद्धाणं।
नमो आयरियाणं। 
नमो उवज्झायाणं।
नमो लोए सव्वसाहूणं। 
एसो पंच नमोक्कारो।
एसोपंचणमोक्कारो। सव्वपावप्पणासणो।
मंगलाणम च सव्वेसिं। पढमं हवई मंगलं।`;

export const Namorhat = `नमोर्हंतसिद्धाचार्योपाध्यायःसर्वसाधुभ्यः`;

export const Khamasaman = `इच्छामि खमा-समणो! वंदिउं, 
जावणिज्जाए निसीहिआए,
मत्थएण वंदामि..`;

export const Icchakar = `इच्छकार सुह-राइ ? (सुह-देवसि?) सुख-तप ?
शरीर-निराबाध ? सुख-संजम-यात्रा-निर्वहते हो जी ?
स्वामि ! शाता है जी ? आहार-पानी का लाभ देना जी.   `;

export const Abbhutthio = `इच्छा-कारेण संदिसह भगवन् !
अब्भुट्ठिओमि, अब्भिंतर-देवसिअं खामेउं ?
इच्छं, खामेमि देवसिअं.
जं किंचि अपत्तिअं, पर-पत्तिअं; भत्ते, पाणे;
विणए, वेयावच्चे; आलावे, संलावे; उच्चासणे, समासणे;
अंतर-भासाए, उवरि-भासाए;
जं किंचि मज्झ विणय-परिहीणं, सुहुमं वा, बायरं वा;
तुब्भे जाणह, अहं न जाणामि; तस्स मिच्छा मि दुक्कडं......`;

export const Iryavahiyam = `इच्छा-कारेण संदिसह भगवन् ! इरियावहियं पडिक्कमामि ?
इच्छं, इच्छामि पडिक्कमिउं
इरियावहियाए, विराहणाए
गमणागमणे
पाण-क्कमणे, बीय-क्कमणे, हरिय-क्कमणे,
ओसा-उत्तिंग-पणग-दग-मट्टी-मक्कडा-संताणा-संकमणे
जे मे जीवा विराहिया
एगिंदिया, बेइंदिया, तेइंदिया, चउरिंदिया, पंचिंदिया
अभिहया, वत्तिया, लेसिया, संघाइया, संघट्टिया,
परियाविया, किलामिया, उद्दविया,
ठाणाओ ठाणं संकामिया, जीवियाओ ववरोविया,
तस्स मिच्छा मि दुक्कडं`;

export const Tassuttari = `तस्स उत्तरी-करणेणं,
पायच्छित्त-करणेणं,
विसोही-करणेणं, 
विसल्ली-करणेणं,
पावाणं कम्माणं निग्घायणट्ठाए,
ठामि काउस्सग्गं`;

export const Annath = `अन्नत्थ-ऊससिएणं, नीससिएणं, खासिएणं, छीएणं, जंभाइएणं,
उड्डुएणं, वाय-निसग्गेणं, भमलीए, पित्त-मुच्छाए
सुहुमेहिं अंग-संचालेहिं, सुहुमेहिं खेल-संचालेहिं,
सुहुमेहिं दिट्ठि-संचालेहिं
एवमाइएहिं आगारेहिं, अभग्गो अविराहिओ,
हुज्ज मे काउस्सग्गो |
जाव अरिहंताणं भगवंताणं, नमुक्कारेणं न पारेमि
ताव कायं ठाणेणं मोणेणं झाणेणं, अप्पाणं वोसिरामि`;

export const Logass = `लोगस्स उज्जोअ-गरे, धम्म-तित्थ-यरे जिणे
अरिहंते कित्तइस्सं, चउवीसं पि केवली
उसभ-मजिअं च वंदे, संभव-मभिणंदणं च सुमइं च
पउम-प्पहं सुपासं, जिणं च चंद-प्पहं वंदे 
सुविहिं च पुप्फ-दंतं, सीअल-सिज्जंस-वासु-पुज्जं च
विमल-मणंतं च जिणं, धम्मं संतिं च वंदामि 
कुंथुं अरं च मल्लिं, वंदे मुणि-सुव्वयं नमि-जिणं च
वंदामि रिट्ठ-नेमिं, पासं तह वद्धमाणं च 
एवं मए अभिथुआ, विहुय-रय-मला पहीण-जर-मरणा
चउ-वीसं पि जिणवरा, तित्थ-यरा मे पसीयंतु 
कित्तिय-वंदिय-महिया, जे ए लोगस्स उत्तमा सिद्धा
आरुग्ग-बोहि-लाभं, समाहि-वर-मुत्तमं-दिंतु 
चंदेसु निम्मल-यरा, आइच्चेसु अहियं पयास-यरा
सागर-वर-गंभीरा, सिद्धा सिद्धिं मम दिसंतु `;

export const Jankinchi = `जं किंचि नाम तित्थं ,
सग्गे पायालि मणुस्से लोए ,
जाइं जिण बिंबाइं, 
ताइं सव्वाइं वंदामि`;

export const Namutthunam = `नमुत्थु णं, अरिहंताणं, भगवंताणं
आइ-गराणं, तित्थ-यराणं, सयं-संबुद्धाणं
पुरिसुत्तमाणं, पुरिस-सीहाणं, पुरिस-वर-पुंडरीआणं,
पुरिस-वर-गंध-हत्थीणं
लोगुत्तमाणं, लोग-नाहाणं, लोग-हिआणं,
लोग-पईवाणं, लोग-पज्जोअ-गराणं
अभय-दयाणं, चक्खु-दयाणं, मग्ग-दयाणं,
सरण-दयाणं, बोहि-दयाणं
धम्म-दयाणं, धम्म-देसयाणं, धम्म-नायगाणं,
धम्म-सारहीणं, धम्म-वर-चाउरंत-चक्कवट्टीणं
अप्पडिहय-वर-नाण-दंसण-धराणं, वियट्ट-छउमाणं
जिणाणं, जावयाणं, तिन्नाणं, तारयाणं, बुद्धाणं,
बोहयाणं, मुत्ताणं, मोअगाणं
सव्वन्नूणं, सव्व-दरिसीणं, सिव-मयल-मरुअ-मणंत-
मक्खय-मव्वाबाह-मपुणरावित्ति सिद्धिगइ-नामधेयं
ठाणं संपत्ताणं, नमो जिणाणं, जिअ-भयाणं
जे अ अईया सिद्धा, जे अ भविस्संति-णागए काले.
संपइ अ वट्टमाणा, सव्वे ति-विहेण वंदामि `;

export const Javanticheiam = `जावंति चेइआइं, 
उड्डे अ अहे अ तिरिअ लोए अ,
सव्वाइं ताइं वंदे
इह संतो तत्थ संताइं..`;

export const Javantkevisahu = `जावंति चेइआइं, 
उड्डे अ अहे अ तिरिअ लोए अ,
सव्वाइं ताइं वंदे
इह संतो तत्थ संताइं..`;

export const Uvasaggaharm = `उवसग्ग-हरं पासं, पासं वंदामि कम्म-घण मुक्कं ।
विसहर-विस-निन्नासं, मंगल-कल्लाण-आवासं 
विसहर-फुलिंग-मंतं, कंठे धारेइ जो सया मणुओ ।
तस्स गह-रोग-मारी, दुट्ठ जरा जंति उवसामं 
चिट्ठउ दुरे मंतो, तुज्झ पणामो वि बहु फलो होइ ।
नर-तिरिएसु वि जीवा, पावंति न दुक्ख-दोगच्चं
तुह सम्मत्ते लद्धे, चिंतामणि-कप्प-पायव-ब्भहिए ।
पावंति अविग्घेणं, जीवा अयरामरं ठाणं 
इअ संथुओ महायस ! भत्ति-ब्भर-निब्भरेण हिअएण ।
ता देव ! दिज्ज बोहिं, भवे भवे पास ! जिण-चंद ! `;

export const Jayviyaraya = `जय वीयराय! जग-गुरु!, 
होउ ममं तुह प्पभावओ भयवं!
भव-निव्वेओ मग्गाणुसारिआ इट्ठफल-सिद्धी    
लोग-विरुद्ध-च्चाओ गुरु-जण-पूआ परत्थ-करणं च
सुह-गुरु-जोगो तव्वयण-सेवणा आ-भवमखंडा    
वारिज्जइ जइ वि नियाण-बंधणं वीयराय! तुह समये
तह वि मम हुज्ज सेवा, भवे भवे तुम्ह चलणाणं    
दुक्ख-क्खओ कम्म-क्खओ, 
समाहि-मरणं च बोहि-लाभो अ
संपज्जउ मह एअं, तुह नाह! पणाम-करणेणं    
सर्व-मंगल-मांगल्यं , सर्व कल्याण कारणम् ।
प्रधानां सर्व धर्माणां, जैन जयतु शासनम् ॥  `;

export const Jayviyarayashort = `जय वीयराय! जग-गुरु!, 
होउ ममं तुह प्पभावओ भयवं!
भव-निव्वेओ मग्गाणुसारिआ इट्ठफल-सिद्धी    
लोग-विरुद्ध-च्चाओ गुरु-जण-पूआ परत्थ-करणं च
सुह-गुरु-जोगो तव्वयण-सेवणा आ-भवमखंडा    `;

export const Arihantecheiyanam = `अरिहंत-चेइयाणं, 
करेमि काउस्सग्गं
वंदण-वत्तिआए, पूअण-वत्तिआए, 
सक्कार-वत्तिआए,सम्माण-वत्तिआए, 
बोहि-लाभ-वत्तिआए, 
निरुवसग्ग-वत्तिआए… .
सद्धाए, मेहाए, धिईए, धारणाए, 
अणुप्पेहाए वड्ढमाणीए, 
ठामि काउस्सग्गं....`;

export const Pukkharvardivaddhe = `पुक्खर-वर-दीवड्ढे, धायइ-संडे अ जंबु-दीवे अ.
भरहेरवय-विदेहे, धम्माइ-गरे नमंसामि
तम-तिमिर-पडल-विद्धं-सणस्स सुर-गण-नरिंद-महिअस्स.
सीमा-धरस्स वंदे, 
पप्फोडिअ-मोह जालस्स
जाई-जरा-मरण-सोग-पणासणस्स,
कल्लाण-पुक्खल-विसाल-सुहा-वहस्स.
को देव-दाणव-नरिंद-गण-च्चिअस्स,
धम्मस्स सार-मुवलब्भ करे पमायं?
सिद्धे भो! पयओ नमो जिण-मए नंदी सया संजमे,
देवं-नाग-सुवन्न-किन्नर-गण-स्सब्भूअ-भावच्चिए.
लोगो जत्थ पइट्ठिओ जगमिणं तेलुक्क-मच्चासुरं,
धम्मो वड्ढउ सासओ विजयओ धम्मुत्तरं वड्ढउ`;

export const Siddhanambuddhanam = `सिद्धाणं बुद्धाणं, पार-गयाणं परंपर-गयाणं
लोअग्ग-मुवगयाणं, 
नमो सया सव्व-सिद्धाणं 
जो देवाण वि देवो, 
जं देवा पंजली नमंसंति
तं देव-देव-महिअं, 
सिरसा वंदे महावीरं 
इक्को वि नमुक्कारो, 
जिणवर-वसहस्स वद्धमाणस्स
संसार-सागराओ, तारेइ नरं व नारिं वा 
उज्जिंत-सेल-सिहरे, 
दिक्खा नाणं निसीहिआ जस्स
तं धम्म-चक्कवट्टिं, अरिट्ठ-नेमिं नमंसामि 
चत्तारि अट्ठ दस दो य, वंदिया जिणवरा चउव्वीसं
परमट्ठ-निट्ठि-अट्ठा,
 सिद्धा सिद्धिं मम दिसंतु`;

export const Bhaktamar = `भक्तामर प्रणता मौली मनि प्रभाणा
मुद्योतकं दलित-पाप-तमो-वितानम् |
सम्यक् प्रणम्य जिन-पाद-यु वालम्बनं भव-जले पततां जनानाम् ||१||

य: संस्तुत: सकल-वाड़्मय-तत्त्व-बोधा-
दुद्भूत-बुद्धि-पटुभि: सुर-लोकनाथै: |
स्तोत्रैर्जगत् त्रितय चित्त हरैरुदारै:,
स्तोष्ये किलाहमपि तं प्रथमं जिनेन्द्रम् ||२||

बुद्धया विनापि विबुधार्चित-पाद-पीठ
स्तोतुं समुद्यत-मतिर्विगत-त्रपोऽहम् |
बालं विहाय जल-संस्थितमिन्दु-बिम्ब-
मन्य: क इच्छति जन: सहसा ग्रहीतुम् ||३||

वक्तुं गुणान्गुण-समुद्र शशांक-कान्तान्,
कस्ते क्षम: सुर-गुरु-प्रतिमोऽपि बुद्ध्या |
कल्पान्त-काल-पवनोद्धत-नक्र-चक्रम्,
को वा तरीतुमलमम्बुनिधिं भुजाभ्याम् ||४||

सोऽहं तथापि तव भक्ति-वशान्मुनीश!
कर्तुं स्तवं विगत-शक्तिरपि प्रवृत्त: |
प्रीत्यात्म-वीर्यमविचार्य मृगी मृगेन्द्रम्,
नाभ्येति किं निज-शिशो: परिपालनार्थम् ||५||

अल्प-श्रुतं श्रुतवतां परिहास-धाम!
त्वद्भक्तिरेव मुखरीकुरुते बलान्माम् |
यत्कोकिल: किल मधौ मधुरं विरौति,
तच्चाम्र-चारु-कलिका-निकरैक-हेतु: ||६||

त्वत्संस्तवेन भव-सन्तति-सन्निबद्धम्
पापं क्षणात्क्षयमुपैति शरीरभाजाम्|
आक्रान्त-लोकमलि-नीलमशेषमाशु,
सूर्यांशु-भिन्नमिव शार्वरमन्धकारम् ||७||

मत्त्वेति नाथ! तव संस्तवनं मयेद-
मारभ्यते तनु-धियापि तव प्रभावात् |
चेतो हरिष्यति सतां नलिनी-दलेषु,
मुक्ता-फलद्युतिमुपैति ननूद-बिन्दु: ||८||

आस्तां तव स्तवनमस्त-समस्त-दोषम्,
त्वत्संकथाऽपि जगतां दुरितानि हन्ति ।
दूरे सहस्रकिरण: कुरुते प्रभैव,
पद्माकरेषु जलजानि विकासभाञ्जि ।।९।।

नात्यद्भुतं भुवन-भूषण भूत-नाथ!
भूतैर्गुणैर्भुवि भवन्तमभिष्टुवन्त: |
तुल्या भवन्ति भवतो ननु तेन किं वा,
भूत्याश्रितं य इह नात्मसमं करोति ||१०||

दृष्ट्वा भवन्तमनिमेष-विलोकनीयम्,
नान्यत्र तोषमुपयाति जनस्य चक्षु: |
पीत्वा पय: शशिकर-द्युति-दुग्ध-सिन्धो:,
क्षारं जलं जल-निधे रसितुं क: इच्छेत् ||११||

यै: शान्त-राग-रुचिभि: परमाणुभिस्त्वम्,
निर्मापितस्त्रिभुवनैक ललाम – भूत !
तावन्त एव खलु तेऽप्यणव: पृथिव्याम्,
यत्ते समानमपरं न हि रूपमस्ति ||१२||

वक्त्रं क्व ते सुर-नरोरग-नेत्र-हारि,
नि:शेष-निर्जित-जगत्त्रितयोपमानम् |
बिम्बं कलंक-मलिनं क्व निशाकरस्य,
यद्वासरे भवति पांडु-पलाश-कल्पम् ||१३||

सम्पूर्ण-मंडल-शशांक-कला-कलाप-
शुभ्रा गुणास्त्रिभुवनं तव लंघयन्ति |
ये संश्रितास्त्रिजगदीश्वर-नाथमेकम्,
कस्तान्निवारयति संचरतो यथेष्टम् ||१४||

चित्रं किमत्र यदि ते त्रिदशांगनाभि-
र्नीतं मनागपि मनो न विकार-मार्गम् |
कल्पान्त-काल-मरुता चलिताचलेन,
किं मन्दराद्रि-शिखरं चलितं कदाचित् ||१५||

निर्धूम वर्तिरपवर्जित तैल पूर:,
कृत्स्नं जगत्त्रयमिदं प्रकटीकरोषि |
गम्यो न जातु मरुतां चलिताचलानाम्,
दीपोऽपरस्त्वमसि नाथ जगत्प्रकाश: ||१६||

नास्तं कदाचिदुपयासि न राहु-गम्य:,
स्पष्टीकरोषि सहसा युगपज्जगन्ति |
नाम्भोधरोदर-निरुद्ध-महा-प्रभाव:,
सूर्यातिशायि-महिमासि मुनीन्द्र! लोके ||१७||

नित्योदयं दलित-मोह-महान्धकारम्,
गम्यं न राहु-वदनस्य न वारिदानाम् |
विभ्राजते तव मुखाब्जमनल्पकान्ति,
विद्योतयज्जगदपूर्व-शशान्क-बिम्बम् ||१८||

किं शर्वरीषु शशिनाऽह्नि विवस्वता वा,
युष्मन्मुखेन्दु-दलितेषु तम:सु नाथ |
निष्पन्न-शालि-वन-शालिनि जीव-लोके,
कार्यं कियज्जलधरैर्जल-भार-नम्रै: ||१९||

ज्ञानं यथा त्वयि विभाति कृतावकाशम्, नैवं तथा हरिहरादिषु नायकेषु |
तेज: स्फुरन्मणिषु याति यथा महत्त्वम्,
नैवं तु काच-शकले किरणाकुलेऽपि ||२०||

मन्ये वरं हरिहरादय एव दृष्टा,
दृष्टेषु येषु हृदयं त्वयि तोषमेति |
किं वीक्षितेन भवता भुवि येन नान्य:,
कश्चिन्मनो हरति नाथ! भवान्तरेऽपि ||२१||

स्त्रीणां शतानि शतशो जनयन्ति पुत्रान्,
नान्या सुतं त्वदुपमं जननी प्रसूता |
सर्वा दिशो दधति भानि सहस्र-रश्मिम्,
प्राच्येव दिग्जनयति स्फुरदंशुजालम् ||२२||

त्वामामनन्ति मुनय: परमं पुमांस-
मादित्य-वर्णममलं तमस: पुरस्तात् |
त्वामेव सम्यगुपलभ्य जयन्ति मृत्युम्,
नान्य: शिव: शिवपदस्य मुनीन्द्र! पन्था: ||२३||

त्वामव्ययं विभुमचिन्त्यमसंख्यमाद्यम्,
ब्रह्माण-मीश्वर-मनन्त-मनंगकेतुम् |
योगीश्वरं विदितयोगमनेकमेकम्,
ज्ञानस्वरूपममलं प्रवदन्ति सन्त: ||२४||

बुद्धस्त्वमेव विबुधार्चित-बुद्धि-बोधात्,
त्वं शंकरोऽसि भुवन-त्रय-शंकरत्वात् |
धातासि धीर! शिवमार्ग-विधेर्विधानात्,
व्यक्तं त्वमेव भगवन्! पुरुषोत्तमोऽसि ||२५||

तुभ्यं नमस्त्रिभुवनार्ति-हराय नाथ!
तुभ्यं नम: क्षिति-तलामल-भूषणाय |
तुभ्यं नमस्त्रिजगत: परमेश्वराय,
तुभ्यं नमो जिन! भवोदधि-शोषणाय ||२६||

को विस्मयोऽत्र यदि नाम गुणैरशेषै-
स्त्वं संश्रितो निरवकाशतया मुनीश !
दोषैरुपात्त-विविधाश्रय जात – गर्वैः
स्वप्नान्तरेऽपि न कदाचिदपीक्षितोऽसि ||२७||

उच्चैरशोक तरु संश्रितमुन्मयूख-
माभाति रूपममलं भवतो नितान्तम् |
स्पष्टोल्लसत्किरणमस्त-तमो-वितानम्,
बिम्बं रवेरिव पयोधर-पाश्र्ववर्ति ||२८||

सिंहासने मणि-मयूख-शिखा-विचित्रे,
विभ्राजते तव वपु: कनकावदातम् |
बिम्बं वियद्विलसदंशुलता-वितानम्,
तुंगोदयाद्रि-शिरसीव सहस्र-रश्मे: ||२९||

कुन्दावदात-चल-चामर-चारु-शोभम्,
विभ्राजते तव वपु: कलधौत-कान्तम् |
उद्यच्छ्शांक शुचि-निर्झर-वारि-धार-
मुच्चैस्तटं सुरगिरेरिव शातकौम्भम् ||३०||

छत्र-त्रयं तव विभाति शशांककान्त-
मुच्चै: स्थितं स्थगित-भानु-कर-प्रतापम् |
मुक्ता-फल-प्रकर-जाल-विवृद्ध-शोभम्,
प्रख्यापयत्त्रिजगत: परमेश्वरत्वम् ||३१||

गम्भीर-तार-रव-पूरित-दिग्विभाग-
स्त्रैलोक्य-लोक-शुभ-संगमभूतिदक्ष: |
सद्धर्मराज-जय-घोषण-घोषक: सन्,
खे दुन्दुभिर्व्-नति ते यशस: प्रवादी ||३२||

मन्दार सुन्दर नमेरु सुपारिजात-
सन्तानकादि-कुसुमोत्कर-वृष्टिरुद्धा |
गन्धोद-बिन्दु-शुभ-मन्द-मरुत्प्रयाता,
दिव्या दिव: पतति ते वचसां ततिर्वा ||३३||

शुम्भत्प्रभा-वलय-भूरि-विभाविभोस्ते,
लोकत्रये द्युतिमतां द्युतिमाक्षिपन्ति |
प्रोद्यद्दिवाकर-निरन्तर-भूरि – संख्या,
दीप्त्या जयत्यपि निशामपि सोम-सौम्याम् ||३४||

स्वर्गापवर्ग-गम-मार्ग-विमार्गणेष्ट:,
सद्धर्म-तत्त्व-कथनैक-पटुस्त्रिलोक्या: |
दिव्य-ध्वनिर्भवति ते विशदार्थ-सर्व-
भाषा-स्वभाव-परिणाम-गुणै: प्रयोज्य: ||३५||

उन्निद्र-हेम-नव-पंकज-पुञ्ज-कान्ती,
पर्युल्लसन्नख-मयूख-शिखाभिरामौ |
पादौ पदानि तव यत्र जिनेन्द्र! धत्त:,
पद्मानि तत्र विबुधा: परिकल्पयन्ति ||३६||

इत्थं यथा तव विभूतिरभूज्जिनेन्द्र!
धर्मोपदेशन – विधौ न तथा परस्य |
यादृक्प्रभा दिनकृत: प्रहतान्धकारा,
तादृक्कुतो ग्रह-गणस्य विकाशिनोऽपि ||३७||

श्च्योतन्मदाविल-विलोल-कपोल-मूल-
मत्त-भ्रमद्-भ्रमर-नाद-विवृद्ध-कोपम् |
ऐरावताभमिभ मुद्धतमापतन्तम्,
दृष्ट्वा भयं भवति नो भवदाश्रितानाम् ||३८||

भिन्नेभ-कुम्भ-गलदुज्ज्वल-शोणिताक्त-
मुक्ता-फल-प्रकर-भूषित-भूमि-भाग: |
बद्ध-क्रम: क्रम-गतं हरिणाधिपोऽपि,
नाक्रामति क्रम-युगाचल-संश्रितं ते ||३९||

कल्पान्त-काल-पवनोद्धत-वह्नि-कल्पम्,
दावानलं ज्वलितमुज्ज्वलमुत्स्फुलिंगम् |
विश्वं जिघत्सुमिव सम्मुखमापतन्तम्,
त्वन्नाम-कीर्तन-जलं शमयत्यशेषम् ||४०||

रक्तेक्षणं समद-कोकिल-कण्ठ-नीलम्,
क्रोधोद्धतं फणिनमुत्फणमापतन्तम् |
आक्रामति क्रम-युगेण निरस्त-शंक-
स्त्वन्नाम-नागदमनी हृदि यस्य पुंस: ||४१||

वल्गत्तुरंगगज-गर्जित-भीमनाद-
माजौ बलं बलवतामपि भूपतीनाम् |
उद्यद्दिवाकर-मयूख-शिखापविद्धम्,
त्वत्कीर्तनात्तम इवाशु भिदामुपैति ||४२||

कुन्ताग्र-भिन्न-गज-शोणित-वारिवाह-
वेगावतार तरणातुर योध–भीमे |
युद्धे जयं विजित-दुर्जय-जेय-पक्षा-
स्त्वत्पाद-पंकज-वनाश्रयिणो लभन्ते ||४३||

अम्भोनिधौक्षुभित-भीषण-नक्र-चक्र-
पाठीन-पीठ-भय-दोल्वण – वाड़वाग्नौ |
रंगत्तरंग-शिखर-स्थित-यान-पात्रास्-
त्रासं विहाय भवत: स्मरणाद् व्रजन्ति ||४४||

उद्भूत-भीषण-जलोदर-भार-भुग्ना:,
शोच्यां दशामुपगताश्च्युत-जीविताशा: |
त्वत्पाद-पंकज-रजोऽमृत-दिग्ध-देहा,
मर्याna भवन्ति मकरध्वज-तुल्यरूपा: ||४५||

आपाद-कण्ठमुरु-श्रृंखल-वेष्टितांगा:,
गाढं वृहन्निगड-कोटि-निघृष्ट-जंघा: |
त्वन्नाम-मन्त्रमनिशं मनुजा: स्मरन्त:,
सद्य: स्वयं विगत-बन्ध-भया भवन्ति ||४६||

मत्तद्विपेन्द्र मृगराज-दवानलाहि-
संग्राम-वारिधि-महोदर-बन्धनोत्थम् |
तस्याशु नाशमुपयाति भयं भियेव,
यस्तावकं स्तवमिमं मतिमान धी ते ||४७||

स्तोत्र-स्रजं तव जिनेन्द्र! गुणैर्निबद्धाम्,
भक्त्या मया रुचिर-वर्ण-विचित्र-पुष्पाम् |
धत्ते जनो य इह कण्ठ-गतामजस्रम्,
तं ‘मानतुंग’मवशा समुपैति लक्ष्मी: ||४८||`;
